trade_exp/src/Documents/НачислениеИСписаниеБонусныхБаллов/НачислениеИСписаниеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НачислениеИСписаниеБонусныхБаллов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПравилоНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8158662b-6a9a-4862-8b90-82fc42b89722">
    <name>Причина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1337e572-00d6-47b1-8f0b-eb21595b97f2">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55fe50f5-ddbd-455c-9099-0f0bff057d44">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="959ca8c5-0d9a-4cc5-ab96-2fe00bd0ada9">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0d224d2c-ba57-4298-be05-ab8f3a7838ed">
    <name>ВидПравила</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a9e9e1c-9b67-434d-b6d2-112391d11cf1">
    <name>КомментарийВКарточкиПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db7d6939-2cd5-4ee3-966e-75f50f11577f">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ff99f87-48f6-4cc0-8cc6-e248bfd00b83">
    <name>Утверждающий1</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7c188b1-fc86-45b4-a790-80c762a23fa5">
    <name>Утверждающий2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01d5fa18-87ef-47ab-8eeb-3f63e64ac0e9">
    <name>ИДЭлементаВБитриксе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="77ab5aa4-e2f0-4204-a0d2-19561758ca39">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисление</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачислитьЗаСчет</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/БонусныеБаллы/БонусныеБаллы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e3cba07e-b273-45b0-98b0-fb46a8dc5694">
  <name>БонусныеБаллы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="c272e1ef-3e78-4217-a586-b04d493ae9c7">
    <name>Начислено</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="045d5c04-a494-4ce1-8feb-c971c832360d">
    <name>НачисленоСтатус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d25ef04e-457d-44fa-8725-25a813516807">
    <name>НачисленоКП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="372f8640-d32c-41d8-b10c-d2f1ae57a694">
    <name>НачисленоПрочее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d3b7c92b-14d3-4a4e-911a-d390d54c81e9">
    <name>КСписанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1758d045-4e77-4376-b4b7-f8c4d0745f49">
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="eae49cfa-4bed-4293-959e-c0232deed12d">
    <name>Зарезервировано</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="27ad958d-13f3-4ed5-bfe8-57104e687aa8">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2ad6036-ba65-416c-b1ec-c8981b70ed01">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56c44fed-c51a-4f96-8f0e-631f22cadcde">
    <name>ДатаКОбработке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="d465f3dc-4b7b-40a0-970e-da046f213d6d">
    <name>БонуснаяПрограммаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f1f1f3cd-c388-438a-8a49-8e43fd10ced8">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/НачислениеИСписаниеБонусныхБаллов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт  
	
	Если Не ЗначениеЗаполнено(БонуснаяПрограммаЛояльности.Ссылка) Тогда
		ЗначениеПоУмолчанию = Справочники.БонусныеПрограммыЛояльности.НайтиПоНаименованию("Бонус от ALTERRA");
		БонуснаяПрограммаЛояльности = ЗначениеПоУмолчанию;	
	КонецЕсли;  
	
	Ответственный = Пользователи.ТекущийПользователь();  
	Утверждающий1 = ДопМодуль.ПолучитьРуководителяОтдела(Ответственный);

	ТекстОшибки = ЗаполнитьДанныеПоОснованию(ДанныеЗаполнения); 
	Если ТекстОшибки <> "" Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 	
	ЗаполнитьОтвественного();
	ЗаполнитьСуммуДокумента(); 
КонецПроцедуры

Процедура ЗаполнитьОтвественного()
	Если ЭтотОбъект.Ответственный = Справочники.Пользователи.ПустаяСсылка() ТОгда 
		ЭтотОбъект.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("Администратор");   
	КонецЕсли;
КонецПроцедуры 

Процедура ЗаполнитьСуммуДокумента()
	СуммаДокумента = 0;  
	ВидПравила = ЭтотОбъект.ВидПравила; 
	Если ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Списание Тогда 
		Для каждого строка из ЭтотОбъект.Списание Цикл
			СуммаДокумента = СуммаДокумента + Строка.Баллы; 
		КонецЦикла;   
		СуммаДОкумента = СуммаДокумента * (-1); 
	ИНачеЕсли ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление Тогда 
		Для каждого строка из ЭтотОбъект.Начисление Цикл
			СуммаДокумента = СуммаДокумента + Строка.Баллы; 
		КонецЦикла;  
	КонецЕсли; 
	ЭтотОбъект.СуммаДокумента = СуммаДокумента; 		
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")   
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения) 
	
	#Вставка	
	Если Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.Исполнен Тогда
		#КонецВставки 	
		
		ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
		
		#Вставка 
	ИначеЕсли Проведен Тогда
		УдалитьДвиженияББ();
		//ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);	
	КонецЕсли;
	#КонецВставки  
	
КонецПроцедуры

Процедура ЗаполнитьПоОбращениюКлиента(ДанныеЗаполнения) 
	
	Документ = ДанныеЗаполнения;                    		
	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("По жалобе (по бп)"); 
	КлиентИзОснования = ДанныеЗаполнения.Клиент;  	
	Комментарий = ДанныеЗаполнения.Содержание;
	НС = Начисление.Добавить();  
	НС.Партнер = КлиентИзОснования;  
	
КонецПроцедуры 

Процедура ЗаполнитьПоДокументуПродажи(ДанныеЗаполнения)
	
	Документ = ДанныеЗаполнения;  
	КлиентИзОснования = ДанныеЗаполнения.Партнер; 
	НС = Начисление.Добавить();  
	НС.Партнер = КлиентИзОснования;  	
	
КонецПроцедуры

Процедура ЗаполнитьПоПересчетуТоваров(ДанныеЗаполнения)
	
	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоНаименованию("Обмен в ТЗ (по БП)"); 
	Документ = ДанныеЗаполнения; 
	
	ТоварCписываемый = "";
	ТоварПриходуемый = "";
	
	Для Каждого Строка Из Документ.Товары Цикл 
		
		Факт = Строка.КоличествоУпаковокФакт;
		Учет = Строка.КоличествоУпаковок; 
		
		Если Факт < Учет  Тогда   
			
			ТоварCписываемый = ТоварCписываемый + "
			|" + Строка.Номенклатура + " ("+(Факт-Учет)+")";
			
		ИначеЕсли  Факт > Учет Тогда 
			
			ТоварПриходуемый = ТоварПриходуемый + "
			|" + Строка.Номенклатура + " ("+(Факт-Учет)+")";
			
		КонецЕсли;
		
	КонецЦикла;
	
	Комментарий = "Товар списываемый:" + ТоварCписываемый + " 
	|
	|Товар приходуемый:" +  ТоварПриходуемый;
	
КонецПроцедуры

Функция УжеЕстьДокументНачисленияББ(ДокОснование,ТипДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеИСписаниеБонусныхБаллов.Ссылка КАК Ссылка
	|ИЗ
	|	&ДокументОснование КАК ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеИСписаниеБонусныхБаллов КАК НачислениеИСписаниеБонусныхБаллов
	|		ПО ДокументОснование.Ссылка = НачислениеИСписаниеБонусныхБаллов.Документ
	|ГДЕ
	|	ДокументОснование.Ссылка = &Ссылка
	|	И НачислениеИСписаниеБонусныхБаллов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДокументОснование",ТипДокумента);	
	
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции


Процедура УдалитьДвиженияББ()
	
	Набор = РегистрыНакопления.БонусныеБаллы.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Ссылка);
	Набор.Записать();
	
КонецПроцедуры

Функция КлиентуМожноНачислятьББ(Партнер)  Экспорт 
	
	
	Если НЕ (АльтерраОбщегоНазначения.ЭтоБригадир(Партнер) Или АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Партнер)) Тогда 
		
		Если Не ДопМодуль.РольДоступнаОтделАналитики() Тогда 
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	Возврат Истина;	
Конецфункции

Функция ЗаполнитьДанныеПоОснованию(ДанныеЗаполнения)Экспорт  
	

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения); 
	ТекстИсключенияПоКлиенту = "Клиент не является ни Частным лицом,ни Бригадиром! Для таких клиентов не предусмотрено участие в Бонусной программе.";  
	ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление;
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ОбращениеКлиента") Тогда 
		
		Если НЕ ДанныеЗаполнения.ВидОбращения = Перечисления.ВидыОбращений.Жалоба Тогда
			Возврат "Создание документа ""Начисление и списание бонусных баллов"" возможен на основании Обращения только по жалобе"; 
		ИначеЕсли УжеЕстьДокументНачисленияББ(ДанныеЗаполнения,"Документ.ОбращениеКлиента") Тогда
			Возврат "На основании данного Обращения уже создан документ ""Начисление и списание бонусных баллов"" "; 
		КонецЕсли;
		
		Если Не КлиентуМожноНачислятьББ(ДанныеЗаполнения.Клиент) Тогда 
			Возврат ТекстИсключенияПоКлиенту;
		КонецЕсли;
		
		ЗаполнитьПоОбращениюКлиента(ДанныеЗаполнения);  
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или  ТипДанныхЗаполнения = Тип("ДокументСсылка.ЧекККМ") Тогда 
		
		Если Не КлиентуМожноНачислятьББ(ДанныеЗаполнения.Партнер) Тогда
			Возврат ТекстИсключенияПоКлиенту;
		КонецЕсли;
		
		ЗаполнитьПоДокументуПродажи(ДанныеЗаполнения);   
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		
		Если ДанныеЗаполнения.ТипПересчета = Справочники.ТипыПересчетов.НайтиПоНаименованию("Обмен") Тогда
			
			Если УжеЕстьДокументНачисленияББ(ДанныеЗаполнения, "Документ.ПересчетТоваров") Тогда
				Возврат "На основании данного Пересчета уже создан документ ""Начисление и списание бонусных баллов"" "; 
			КонецЕсли; 
			ЗаполнитьПоПересчетуТоваров(ДанныеЗаполнения); 
		Иначе
			Возврат "Создание документа ""Начисление и списание бонусных баллов"" возможен на основании Пересчета только с типом ""Обмен"""; 
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Документ) Тогда
		Комментарий = "Начисление создано на основании документа """ + Документ + """" +"
		|" +"
		|"+ Комментарий;
	КонецЕсли; 
		
	Статус = Перечисления.СтатусыНачислениеИСписаниеБонусныхБаллов.НаСогласовании;
	
	Возврат "";
	
КонецФункции

&Перед("ПриКопировании")
Процедура Док_ПриКопировании(ОбъектКопирования)
     ВызватьИсключение "Копирование документа ""Начисление и списание бонусных баллов"" запрещено!";	
КонецПроцедуры

#КонецЕсли
